{
  "main": {
    "name": "Drake Rundell",
    "occupation": "Aerospace Engineer. Builder. Coder. Innovator.",
    "image": "profilepic.jpeg",
    "bio" : "I am currently working for General Motors as a Design Release Engineer based out of Warren, MI - previously working for Williams International as an Advanced Manufacturing Engineer in the aerospace industry. I enjoy being immersed and challenged in situations that allow me to problem solve solutions, whether they are through programming or require a hands-on solution.",
    "bio2":"Many of the projects that I have completed or been involved in are listed below, along with work experiences and the skills that I have acquired. I am always looking for new opportunities and networking, so feel free to contact me any way that works for you!",
    "contactmessage": "I strive to put myself out there and challenge myself in order to grow as both a member of a team and an individual. I am always looking to expand my network and overall knowledge in engineering and beyond. Feel free to contact me about connecting through phone, email, or LinkedIn.",
    "email": "drrundel@umich.edu",
    "phone": "810-772-9656",
    "address": {
      "state": "Auburn Hills, Michigan"
    },
    "website": "",
    "resumedownload": "../docs/DrakeRundellResume.pdf",
    "social": [
      {
        "name": "phone",
        "url": "tel:8107729656",
        "className": "fa fa-phone"
      },
      {
        "name": "email",
        "url": "mailto:drrundel@umich.edu",
        "className": "fa fa-envelope"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/drundell/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/drrundel",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Through work and educational experience I have had the opportunity to be involved in various projects and assignments, which has allowed me to learn valuable skills that are applicable to future opportunities.",
    "skillmessage2": "These skills involve working with computer software, programming in several languages, using advanced technology, learning how to solve problems with critical thinking, working collaborating in a team or group setting, and how to produce documents that convey engineering principals of work in a concise and respectful tone.",
    "education": [
      {
        "school": "Master's Program",
        "graduated": "Planning on Fall 2022",
        "degree": "M.S. Computer Science",
        "description": "Targeting a Master's in Computer Science to coincide with desire to transition and grow with a role that focuses around programming and compliments my current skill set."
      },
      {
        "school": "University of Michigan - College of Engineering",
        "degree": "B.S. Aerospace Engineering",
        "graduated": "May 2020",
        "gpa": "Cumulative GPA: 3.43/4.0",
        "description": "Coursework in Aerodynamics, Aerospace Computational Methods, Controls, Propulsion, Structures, Systems/Design, Dynamics, Electrical Circuits, Materials & Manufacturing, Numerical Methods, Problem Solving and Programming, and Space Flight Mechanics."
      }
    ],
    "work": [
      {
        "company": "General Motors",
        "title": "Design Release Engineer - Air Delivery ",
        "years": "July 2021 - Present",
        "description": "• Currently supporting production and future components with design/analysis study, managing supplier contact, overseeing validation to testing methods, and supporting cross functional communication to program teams.",
        "description2": "• Ensure engine designs win in their market segment with the safest and highest quality air delivery components through execution to program teams.",
        "description3": "• Conduct comprehensive benchmarking activities to execute launch excellence and deliver flawless launches, while creating leading edge designs that meet customer’s expectations for safety, quality, cost & mass." 
      },
      {
        "company": "Williams International",
        "title": "Advanced Manufacturing Engineer",
        "years": "June 2020 - July 2021",
        "description": "• Worked within the electrical manufacturing cell focusing on the development of tooling and fixtures for precision electromechanical assemblies. ",
        "description2": "• Assisted development of plastic additive area within cell that provides low-cost and rapid manufacturing of tooling using fused deposition modeling while progressing to producing production hardware using resin additives.",
        "description3": "• Developed and revised tooling and process plans for low- and high-level assemblies to improve efficiency and reduce errors to assist with 6S continuous improvement effort." 
      },
      {
        "company": "Falcon Stamping Inc.",
        "title": "Mechanical Engineering Intern",
        "years": "June 2017 - August 2019",
        "description": "• Focused on assembly process research and development with responsibilities of design and fabrication.",
        "description2": "• Constructed control systems with machined metals, automated mechanics and fused deposition modeling (FDM) technologies. ",
        "description3": "• Assisted in modernizing designs of progressive dies using drafting tools and computer-aided design along with making corrections and ensuring accuracy for dated drawings." 
      }
    ],
    "skills": [
      {
        "name": "LaTeX",
        "level": "95%"
      },
      {
        "name": "MATLAB",
        "level": "75%"
      },
      {
        "name": "ReactJs",
        "level": "30%"
      },
      {
        "name": "CSS",
        "level": "70%"
      },
      {
        "name": "HTML5",
        "level": "50%"
      },
      {
        "name": "C/C++",
        "level": "40%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Blockchain Project Website"        ,
        "category": "Part of a team working on a Blockchain project founded on charitable aspects - affordable housing & climate change relief..",
        "image": "block.webp",
        "url": "https://ethereum.org/en/"
      },
      {
        "title": "Regenerative Nozzle Wall Cooling Simulation",
        "category": "Simulated the solution to the heat transfer equation using a finite-element solver on the three domains.",
        "image": "hotnotch.webp",
        "url": "../docs/regenerative_cooling_project.pdf"
      },
      {
        "title": "Lunar Lander Truss Simulation Project"        ,
        "category": "Simulated a leg of a lunar lander using differential equations stemming from the physics of damped oscillations.",
        "image": "animated_truss.gif",
        "url": "../docs/lunar_lander_project.pdf"
      },
      {
        "title": "Lunar Manuevers for Space Based Transit        ",
        "category": "Completed simulations in NASA developed General Mission Analysis Tool Software (GMAT) with data analysis in MATLAB.",
        "image": "eccgroundtracks.webp",
        "url": "../docs/lunar_based_manuevers_for_applications_in_space_transit.pdf"
      },
      {
        "title": "Optimization of Truck Mirror Camera System",
        "category": "Sponsored design project concerning the aerodynamic improvement and soiling reduction of camera systems.",
        "image": "mirroreyesimulation.webp",
        "url": "../docs/ae405_final_report.pdf"
      },
      {
        "title": "Automated Busbar Insulator Assembly        ",
        "category": "Lead the developmental effort of an automated system used to snap plastic covers on precision stamped busbars.",
        "image": "isoview.webp",
        "url": "../docs/automated_busbar_insulator_assembly.pdf"
      },
      {
        "title": "Semi-Automated Adhesive Applicator",
        "category": "Accelerates the assembly of cardboard reels for overseas shipping of stamped metal terminals through 2D linear motion glue extrusion.",
        "image": "glueiso.webp",
        "url": "../docs/semi_automated_glue_applicator.pdf"
      },
      {
        "title": "Hovercraft System Design, Build, & Test        ",
        "category": "Worked in a group setting to develop a complete radio controlled hovercraft system with custom designed body.",
        "image": "hovercraftiso.webp",
        "url": "../docs/hovercraft_final_presentation.pdf"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
